- pandas는 numpy 2차원 배열에서 가능한 대부분의 데이터 처리 가능  
- 데이터 처리 및 변환을 위한 다양한 function과 method 제공

# 데이터 개수 세기 - count

`count` : NaN 값 제외

## Series count

In [1]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series(range(10))

In [5]:
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [6]:
s[3]

3

In [9]:
s.loc[5:9]

5    5
6    6
7    7
8    8
9    9
dtype: int64

In [10]:
s.loc[5,9]

IndexingError: Too many indexers

In [11]:
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [13]:
s.count()

9

## dataframe count

In [14]:
np.random.seed(2)

In [16]:
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)

In [17]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  2.0
3  0.0  4.0  4.0  2.0

In [34]:
df.loc[2,3] = np.nan

In [35]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [36]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

# titanic dataset

## titanic dataset 불러오기

In [37]:
import seaborn as sns

In [42]:
titanic = sns.load_dataset('titanic')

In [43]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## 데이터 길이 확인

In [44]:
len(titanic)

891

## 데이터 개수 구하기

dataframe 각 열마다 개수 구하기

In [46]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 카테고리 값 세기

`value_counts` : 시리즈의 값이 **정수, 문자열, 카테고리**인 경우 각각의 값이 나온 횟수를 셀 수 있다

### Series value_counts

In [47]:
import pandas as pd
np.random.seed(1)

s2 = pd.Series(np.random.randint(6, size=100))
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [48]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [51]:
s2.count()

100

### Dataframe은 value_counts method 없음

각 열마다 별도 적용

In [52]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [55]:
df.value_counts()

0    1    2    3
0.0  4.0  4.0  2.0    1
2.0  4.0  3.0  0.0    1
3.0  3.0  2.0  1.0    1
Name: count, dtype: int64

In [57]:
df[0].value_counts()

0
3.0    1
2.0    1
4.0    1
0.0    1
Name: count, dtype: int64

In [64]:
for i in range(len(df)):
    print(df[i].value_counts())
    print('--------'*5)

0
3.0    1
2.0    1
4.0    1
0.0    1
Name: count, dtype: int64
----------------------------------------
1
3.0    2
4.0    2
Name: count, dtype: int64
----------------------------------------
2
2.0    1
3.0    1
1.0    1
4.0    1
Name: count, dtype: int64
----------------------------------------
3
1.0    1
0.0    1
2.0    1
Name: count, dtype: int64
----------------------------------------

## 정렬

`sort_index` : 인덱스 값 기준  
`sort_values` : 데이터 값 기준

### Series 정렬

In [66]:
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [68]:
s2.sort_index()

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [69]:
s2.sort_index(ascending=False)

99    3
98    4
97    2
96    5
95    4
     ..
4     1
3     0
2     4
1     3
0     5
Length: 100, dtype: int32

In [70]:
s2.sort_values()

57    0
38    0
39    0
85    0
28    0
     ..
71    5
40    5
46    5
11    5
0     5
Length: 100, dtype: int32

In [71]:
s2.sort_values(ascending=False)

0     5
74    5
23    5
32    5
40    5
     ..
68    0
57    0
77    0
38    0
78    0
Length: 100, dtype: int32

In [76]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [73]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
Name: count, dtype: int64

In [74]:
s2.value_counts().sort_index(ascending=False)

5    16
4    17
3    14
2    13
1    22
0    18
Name: count, dtype: int64

In [75]:
s2.value_counts().sort_values()

2    13
3    14
5    16
4    17
0    18
1    22
Name: count, dtype: int64

In [77]:
s2.value_counts().sort_values(ascending=False)

1    22
0    18
4    17
5    16
3    14
2    13
Name: count, dtype: int64

In [78]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [79]:
s.sort_index()

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [80]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [81]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

### DataFrame 정렬

`by` 인수로 정렬 기준이 되는 열을 지정해줘야 한다.

In [82]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [84]:
df.sort_values(by=0)

     0    1    2    3
3  0.0  4.0  4.0  2.0
1  2.0  4.0  3.0  0.0
0  3.0  3.0  2.0  1.0
2  4.0  3.0  1.0  NaN

`by` 인수에 리스트를 넣으면 리스트 값 순서대로 정렬 기준의 우선 순위가 된다.  
리스트의 첫번째 값을 열의 기준으로 정렬한 후, 동일한 값이 나오면 그 다음 값을 열의 기준으로 정렬한다.

In [88]:
df.sort_values(by=1)

     0    1    2    3
0  3.0  3.0  2.0  1.0
2  4.0  3.0  1.0  NaN
1  2.0  4.0  3.0  0.0
3  0.0  4.0  4.0  2.0

In [87]:
df.sort_values(by=[1,2])

     0    1    2    3
2  4.0  3.0  1.0  NaN
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
3  0.0  4.0  4.0  2.0

## 연습문제 1

`sort_values` 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [89]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [95]:
titanic[['sex', 'age', 'class', 'alive']].count()

sex      891
age      714
class    891
alive    891
dtype: int64

In [96]:
label = ['sex', 'age', 'class', 'alive']

In [103]:
for i in label:
    print(titanic[i].value_counts())
    print('--------'*5)

sex
male      577
female    314
Name: count, dtype: int64
----------------------------------------
age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64
----------------------------------------
class
Third     491
First     216
Second    184
Name: count, dtype: int64
----------------------------------------
alive
no     549
yes    342
Name: count, dtype: int64
----------------------------------------

## 행/열 합계

`sum(axis)` : `axis` 인수에는 합할 방향축 지정 (0 = 행, 1 = 열)

In [104]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [110]:
df2.sum(axis=1) # 열방향 합계 = 행합계

0    35
1    34
2    41
3    42
dtype: int64

In [112]:
df2.sum(axis=0) # 행방향 합계 = 열합계

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [114]:
df2['rowsum'] = df2.sum(axis=1)

In [115]:
df2

   0  1  2  3  4  5  6  7  rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [117]:
df2.loc['colsum'] = df2.sum(axis=0) # 행에 인덱스와 값을 넣으려면 loc

In [118]:
df2

         0   1   2   3   4   5  6   7  rowsum
0        5   8   9   5   0   0  1   7      35
1        6   9   2   4   5   2  4   2      34
2        4   7   7   9   1   7  0   6      41
3        9   9   7   6   9   1  0   1      42
colsum  24  33  25  24  15  10  5  16     152

## 행/열 평균

`mean(axis)`

In [120]:
df

     0    1    2    3
0  3.0  3.0  2.0  1.0
1  2.0  4.0  3.0  0.0
2  4.0  3.0  1.0  NaN
3  0.0  4.0  4.0  2.0

In [122]:
df.mean(axis=0) # 행방향 = 열계산

0    2.25
1    3.50
2    2.50
3    1.00
dtype: float64

In [123]:
df.mean(axis=1) # 열방향 = 행계산

0    2.250000
1    2.250000
2    2.666667
3    2.500000
dtype: float64

## 연습문제 2

1. 타이타닉호 승객의 평균 나이를 구하라.
2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [124]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [127]:
# 1
titanic['age'].mean(axis=0)

29.69911764705882

In [132]:
# 2
titanic[titanic['sex'] == 'female']['age'].mean(axis=0)

27.915708812260537

In [139]:
# 3
titanic[(titanic['class'] == 'First') & (titanic['sex'] == 'female')]['age'].mean(axis=0)

34.61176470588235